sadransh/lis3mdl-SPI-STM32/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * Copyright (c) 2017 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"
#include "spi.h"
#include "usb_device.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */
#include "lis3mdl.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
#define NumOfSensors 1
/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void Error_Handler(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
//HAL_StatusTypeDef rr(uint8_t addr, uint8_t* value) {
//	HAL_StatusTypeDef status;
//	LIS3MDL *x;
//
//	LIS3MDL_CS_LOW(SPI3CS8_GPIO_Port,SPI3CS8_Pin); //CS low
//	SPI_SendRecieveByte(x,addr | 0x80, value);
//	status = SPI_SendRecieveByte(x,0x00, value);
//	LIS3MDL_CS_HIGH(SPI3CS8_GPIO_Port,SPI3CS8_Pin); //CS high
//	return status;
//}
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
HAL_StatusTypeDef spiii(uint8_t txdata, uint8_t* rxdata) // This function is a standard old SPI function that writes and reads data
{
	HAL_StatusTypeDef status;
//	uint8_t rxdata;
	status = HAL_SPI_TransmitReceive(&hspi1, &(txdata), rxdata, 1, 100); // Send One Byte
	//final = rxdata;
	return status;
}


int _write(int fd, char *ptr, int len) {
	CDC_Transmit_FS((uint8_t*) ptr, len);
//	CDC_Transmit_FS("\r\n", 2);
//	HAL_UART_Transmit(&huart1, (uint8_t*) ptr, len, 0xFFFF);


	return len;
}
/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_SPI1_Init();
  MX_SPI2_Init();
  MX_SPI3_Init();
//  MX_USB_DEVICE_Init();

  /* USER CODE BEGIN 2 */
  uint8_t val;
  HAL_GPIO_WritePin(SPI1CS1_GPIO_Port,SPI1CS1_Pin,0);
  spiii(0x8f,&val);
  spiii(0x00,&val);
  HAL_GPIO_WritePin(SPI1CS1_GPIO_Port,SPI1CS1_Pin,1);
  val--;

//HAL_StatusTypeDef status;
//uint8_t x;
//HAL_GPIO_WritePin(SPI3CS8_GPIO_Port,SPI3CS8_Pin,0);
//status = HAL_SPI_TransmitReceive(&hspi3, 0x8F, &x, 1, 100);
//status = HAL_SPI_TransmitReceive(&hspi3, 0x00, &x, 1, 100);
//HAL_GPIO_WritePin(SPI3CS8_GPIO_Port,SPI3CS8_Pin,1);
//rr(0x8f,&x);


//  setbuf(stdout, NULL);;
  	LIS3MDL Sensor[NumOfSensors];
  	for (int i = 0; i < NumOfSensors; i++) {
  		while (HAL_OK != LIS3MDL_setup(&Sensor[i], &hspi3, SPI3CS8_Pin,SPI3CS8_Pin)) {
  			printf("cant init sensoronee\r\n");
  			HAL_Delay(300);
  		}

  		printf("Connected to Sensor %d....\r\n",i+1);
  		LIS3MDL_enableTemperature(&Sensor[i]);
  		LIS3MDL_setPerformance(&Sensor[i],LIS3MDL_PERFORMANCE_ULTRA_HIGH);
  		LIS3MDL_setMode(&Sensor[i],LIS3MDL_MODE_CONTINUOUS);
  		LIS3MDL_setScale(&Sensor[i], LIS3MDL_SCALE_16_GAUSS);
  	}
//  setbuf(stdout, NULL);;
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 *////		printf("Hi %d");///		HAL_Delay(250);

  }
  /* USER CODE END 3 */

  	}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Configure the main internal regulator output voltage 
    */
  __HAL_RCC_PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 72;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 3;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
